api/app/models/assessments_code_challenge.rb

  def self.find_or_create_code_challenge(codewars_id)
    code_challenge = CodeChallenge.find_by(codewars_id: codewars_id)
---
SELECT "code_challenges".* FROM "code_challenges" WHERE "code_challenges"."codewars_id" = $1 LIMIT $2  [["codewars_id", "62f23d84eb2533004be50c0d"], ["LIMIT", 1]]