api/app/controllers/answers_controller.rb

SELECT "code_challenges".* FROM "code_challenges" WHERE "code_challenges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers"
---
    def index
      interviewee = Interviewee.find(params[:interviewee_id])
      code_challenges = interviewee.code_challenges
      answers = interviewee.answers.includes(:code_challenge)

SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      answer = Answer.find(params[:id])

INSERT INTO "answers" ("content", "feedback", "grades", "code_challenge_id", "assessment_id", "interviewee_id", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
      answer = Answer.new(answer_params)
      if answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
      answer = Answer.find(params[:id])