api/app/controllers/application_controller.rb

SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def recruiter
        Recruiter.find(@uid)

SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def interviewee
        Interviewee.find(@uid)