api/app/controllers/assessments_questions_controller.rb

INSERT INTO "assessments_questions" ("question_id", "assessment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question_id", 1], ["assessment_id", 2], ["created_at", "2023-04-30 08:52:29.202489"], ["updated_at", "2023-04-30 08:52:29.202489"]]
---
    def create
        question = AssessmentsQuestion.create!(assessquest_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_assessquest
        AssessmentsQuestion.find(params[:id])