api/app/controllers/assessments_code_challenges_controller.rb

    def find_assesscode
        AssessmentsCodeChallenge.find(params[:id])
---
SELECT "code_challenges".* FROM "code_challenges" WHERE "code_challenges"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]