api/app/controllers/assessments_controller.rb

SELECT "assessments".* FROM "assessments"
---
    def index
        assessments = Assessment.all

INSERT INTO "assessments" ("recruiter_id", "name", "accepted", "duedate", "reviewed", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        assessment = Assessment.create!(assessment_params)

SELECT "assessments".* FROM "assessments" WHERE "assessments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        assessment = Assessment.find(params[:id])