api/app/controllers/assessments_code_challenges_controller.rb

SELECT "code_challenges".* FROM "code_challenges" WHERE "code_challenges"."codewars_id" = $1 LIMIT $2  [["codewars_id", "6344701cd748a12b99c0dbc4"], ["LIMIT", 1]]
INSERT INTO "assessments_code_challenges" ("code_challenge_id", "assessment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code_challenge_id", 1], ["assessment_id", 1], ["created_at", "2023-04-28 19:28:07.156833"], ["updated_at", "2023-04-28 19:28:07.156833"]]
INSERT INTO "code_challenges" ("name", "languages", "description", "totalAttempts", "totalCompleted", "codewars_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        begin
            code_challenge = CodeChallenge.find_by(codewars_id: assesscode_params[:code_challenge_id].to_s) || CodeChallenge.find(assesscode_params[:code_challenge_id].to_i)
        rescue ActiveRecord::RecordNotFound
            # If the code challenge does not exist in the code_challenges table, create a new one
          challenge = CodeChallenge.one_code(assesscode_params[:code_challenge_id].to_s)
        #   puts "code #{challenge}"
          code_challenge = CodeChallenge.create!(
            codewars_id: challenge[0]['id'],
            name: challenge[0]['name'],
            description: challenge[0]['description'],
            languages: challenge[0]['languages'].join(','),
            totalAttempts: challenge[0]['totalAttempts'].to_i,
            totalCompleted: challenge[0]['totalCompleted'].to_i,
          )
        end
        # Create a new record in the assessments_code_challenges table
        code = AssessmentsCodeChallenge.create!(
          assessment_id: assesscode_params[:assessment_id].to_i,
          code_challenge_id: code_challenge.id
        )

SELECT "assessments_code_challenges".* FROM "assessments_code_challenges"
---
    def index
        codes = AssessmentsCodeChallenge.all