api/app/controllers/code_challenges_controller.rb

    def index
      api_codes =  CodeChallenge.code_challenges
      recruiter_codes = CodeChallenge.all
---
SELECT "code_challenges".* FROM "code_challenges"

    def show
      # code = CodeChallenge.one_code(params[:id])
      code = CodeChallenge.find(params[:id])
---
SELECT "code_challenges".* FROM "code_challenges" WHERE "code_challenges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      code = CodeChallenge.create!(code_challenge_params)
---
INSERT INTO "code_challenges" ("name", "languages", "description", "totalAttempts", "totalCompleted", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", nil], ["languages", nil], ["description", nil], ["totalAttempts", nil], ["totalCompleted", nil], ["created_at", "2023-04-25 20:07:41.726843"], ["updated_at", "2023-04-25 20:07:41.726843"]]