api/app/controllers/interviewees_controller.rb

    def delete_account
        user = Interviewee.find(params[:id])
        user.destroy
---
SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 980190964], ["LIMIT", 1]]
DELETE FROM "interviewees" WHERE "interviewees"."id" = $1  [["id", 980190964]]

    def show
        user = Interviewee.find(params[:id])
---
SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 980190969], ["LIMIT", 1]]

    def reset_password
        user = Interviewee.find_by(email: params[:email])
        if user.present?
            user.update(password: params[:new_password])
---
SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."email" = $1 LIMIT $2  [["email", "test@example.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "interviewees" WHERE "interviewees"."email" = $1 AND "interviewees"."id" != $2 LIMIT $3  [["email", "test@example.com"], ["id", 980190963], ["LIMIT", 1]]
UPDATE "interviewees" SET "password_digest" = $1, "updated_at" = $2 WHERE "interviewees"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2023-04-17 12:41:43.219469"], ["id", 980190963]]