api/app/controllers/interviewees_controller.rb

    def register
        user = Interviewee.create(interviewee_params)
---
INSERT INTO "interviewees" ("username", "email", "password_digest", "firstname", "lastname", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def login
        sql = "username = :username OR email = :email"
        user = Interviewee.where(sql, {username: interviewee_params[:username], email: interviewee_params[:email]}).first
---
SELECT "interviewees".* FROM "interviewees" WHERE (username = 'recruiter1' OR email = NULL) ORDER BY "interviewees"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def index
        interviewees = Interviewee.all
---
SELECT "interviewees".* FROM "interviewees"

    def completed_assessments
        interviewees = Interviewee.joins(:completed_assessments).distinct
---
SELECT "assessments".* FROM "assessments" INNER JOIN "invites" ON "assessments"."id" = "invites"."assessment_id" WHERE "invites"."interviewee_id" = $1  [["interviewee_id", 1]]

    def show_responses
        interviewee = Interviewee.find(params[:interviewee_id])
        assessment = interviewee.assessments.find(params[:assessment_id])
        responses = assessment.responses.includes(:question)
---
SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "assessments".* FROM "assessments" INNER JOIN "invites" ON "assessments"."id" = "invites"."assessment_id" WHERE "invites"."interviewee_id" = $1 AND "assessments"."id" = $2 LIMIT $3  [["interviewee_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "responses".* FROM "responses" WHERE "responses"."interviewee_id" = $1  [["interviewee_id", 1]]

    def show_answers
        interviewee = Interviewee.find(params[:interviewee_id])
        assessment = interviewee.assessments.find(params[:assessment_id])
        answers = assessment.answers.includes(:code_challenge)
---
SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "assessments".* FROM "assessments" INNER JOIN "invites" ON "assessments"."id" = "invites"."assessment_id" WHERE "invites"."interviewee_id" = $1 AND "assessments"."id" = $2 LIMIT $3  [["interviewee_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."interviewee_id" = $1  [["interviewee_id", 1]]
SELECT "code_challenges".* FROM "code_challenges" WHERE "code_challenges"."id" = $1  [["id", 1]]