api/app/controllers/invites_controller.rb

SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invites" ("interviewee_id", "recruiter_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["interviewee_id", 1], ["recruiter_id", 4], ["status", nil], ["created_at", "2023-04-19 12:05:30.662442"], ["updated_at", "2023-04-19 12:05:30.662442"]]
---
    def create
        inter = Interviewee.find(params[:interviewee_id])
        invite = recruiter.invites.create!(invite_params.merge(status: "pending"))

SELECT "invites".* FROM "invites" WHERE "invites"."recruiter_id" = $1  [["recruiter_id", 2]]
---
    def index
        invites = recruiter.invites.all

SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index_interviewee_invites
        interviewee = Interviewee.find(params[:interviewee_id])

SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show_interviewee_invite
        interviewee = Interviewee.find(params[:interviewee_id])
        invite = interviewee.invites.find(params[:id])

SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "invites" SET "status" = $1, "updated_at" = $2 WHERE "invites"."id" = $3  [["status", "accepted"], ["updated_at", "2023-04-20 10:11:46.663155"], ["id", 5]]
---
    def accept_assessment
        inter = Interviewee.find(params[:interviewee_id])
        invite = Invite.find(params[:id])
        assessment = invite.assessment

        if invite.interviewee == inter && assessment
          assessment.update!(accepted: true)

SELECT "interviewees".* FROM "interviewees" WHERE "interviewees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "invites" SET "status" = $1, "updated_at" = $2 WHERE "invites"."id" = $3  [["status", "accepted"], ["updated_at", "2023-04-20 10:11:46.663155"], ["id", 5]]
---
  def accept
    inter = Interviewee.find(params[:interviewee_id])
    invite = Invite.find(params[:id])
    if invite.interviewee == inter
        invite.update!(status: 'accepted')