api/app/controllers/questions_controller.rb

    def index
      render json: recruiter.question.all
---
SELECT "questions".* FROM "questions" WHERE "questions"."recruiter_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["recruiter_id", 5], ["id", 5], ["LIMIT", 1]]

    def show
      question = recruiter.question.includes(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
      question = recruiter.questions.new(question_params)
      if question.save
---
INSERT INTO "questions" ("feedback", "assessment_id", "created_at", "updated_at", "question", "content") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["feedback", "correct"], ["assessment_id", 3], ["created_at", "2023-04-18 18:03:49.278976"], ["updated_at", "2023-04-18 18:03:49.278976"], ["question", nil], ["content", "what is your name"]]