api/app/controllers/recruiters_controller.rb

SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", 980190967], ["LIMIT", 1]]
DELETE FROM "recruiters" WHERE "recruiters"."id" = $1  [["id", 980190967]]
---
    def delete_account
        user = Recruiter.find(params[:id])
        user.destroy

SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."email" = $1 LIMIT $2  [["email", "invalid@example.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "recruiters" WHERE "recruiters"."email" = $1 AND "recruiters"."id" != $2 LIMIT $3  [["email", "test@example.com"], ["id", 980190963], ["LIMIT", 1]]
UPDATE "recruiters" SET "password_digest" = $1, "updated_at" = $2 WHERE "recruiters"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2023-04-18 06:19:48.515177"], ["id", 980190963]]
---
    def reset_password
        user = Recruiter.find_by(email: params[:email])
        if user.present?
            user.update(password: params[:new_password])