api/app/controllers/recruiters_controller.rb

INSERT INTO "recruiters" ("username", "email", "password_digest", "firstname", "lastname", "company", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def register
        user =  Recruiter.create(recruiter_params)

SELECT "recruiters".* FROM "recruiters" WHERE (username = 'kevin' OR email = 'kevin@gmail.com') ORDER BY "recruiters"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = Recruiter.where(sql, {username: recruiter_params[:username], email: recruiter_params[:email]}).first

SELECT "recruiters".* FROM "recruiters" WHERE "recruiters"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        user = Recruiter.find(params[:id])